Rolecall_To_Fusion/Rolecall_To_Fusion/Files/RoleCall_FU/Fusion/Contact/Request/ContactRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:typ="http://xmlns.oracle.com/apps/cdm/foundation/parties/personService/applicationModule/types/" xmlns:per="http://xmlns.oracle.com/apps/cdm/foundation/parties/personService/" xmlns:par="http://xmlns.oracle.com/apps/cdm/foundation/parties/partyService/" xmlns:sour="http://xmlns.oracle.com/apps/cdm/foundation/parties/flex/sourceSystemRef/" xmlns:con="http://xmlns.oracle.com/apps/cdm/foundation/parties/contactPointService/" xmlns:con1="http://xmlns.oracle.com/apps/cdm/foundation/parties/flex/contactPoint/" xmlns:par1="http://xmlns.oracle.com/apps/cdm/foundation/parties/flex/partySite/" xmlns:per1="http://xmlns.oracle.com/apps/cdm/foundation/parties/flex/person/" xmlns:rel="http://xmlns.oracle.com/apps/cdm/foundation/parties/relationshipService/" xmlns:org="http://xmlns.oracle.com/apps/cdm/foundation/parties/flex/orgContact/" xmlns:rel1="http://xmlns.oracle.com/apps/cdm/foundation/parties/flex/relationship/">
	<soapenv:Header/>
	<soapenv:Body>
		<typ:updatePerson>
			<typ:personParty>
				<per:ObjectId>300000003167493</per:ObjectId>
				<per:PartyId>300000003167518</per:PartyId>
				<per:PersonProfile>
					<per:PersonProfileId>300000003167518</per:PersonProfileId>
					<per:PersonFirstName>TestingFirstName10</per:PersonFirstName>
					<per:PersonLastName>TestingLastName10</per:PersonLastName>
				</per:PersonProfile>
				<per:Relationship>
					<rel:RelationshipRecId>300000003167519</rel:RelationshipRecId>
					<rel:RelationshipId>300000003167520</rel:RelationshipId>
					<rel:SubjectId>300000003167518</rel:SubjectId>
					<rel:Email>
						<con:ContactPointId>300000003167524</con:ContactPointId>
						<con:ContactPointType>EMAIL</con:ContactPointType>
						<con:EmailAddress>test00212@test.com</con:EmailAddress>
					</rel:Email>
					<rel:Phone>
						<con:ContactPointId>300000003009007</con:ContactPointId>
						<con:ContactPointType>PHONE</con:ContactPointType>
						<con:PhoneCountryCode>91</con:PhoneCountryCode>
						<con:PhoneNumber>9717054321</con:PhoneNumber>
						<con:PhoneLineType>GEN</con:PhoneLineType>
						<con:ContactPointPurpose>BUSINESS</con:ContactPointPurpose>
					</rel:Phone>
				</per:Relationship>
			</typ:personParty>
		</typ:updatePerson>
	</soapenv:Body>
</soapenv:Envelope>
